In [ ]:
import requests
import pandas as pd
import json

In [8]:
# https://api.bcb.gov.br/dados/serie/bcdata.sgs.1/dados?formato=json

# X = 25239

# r = requests.get('https://api.bcb.gov.br/dados/serie/bcdata.sgs.' + str(X) +'/dados?formato=json')

r = requests.get('https://api.bcb.gov.br/dados/serie/bcdata.sgs.25239/dados?formato=json')

r.status_code

200

In [ ]:
# Useful Information

# 1207  PIB em R$ correntes
# 21774 População
# 21775 PIB per capita em R$ correntes
# 1619	Salário Mínimo

# Employment

# 24369	Taxa de desocupação - PNADC
# 24370	Pessoas em idade de trabalhar - PNADC
# 24371	Empregados no setor privado e público - PNADC
# 24372 Empregados no setor público - PNADC
# 24373	Empregado por conta própria - PNADC
# 24374	Empregadores - PNADC
# 24375	Empregados no setor privado - Com carteira - PNADC
# 24376	Empregados no setor privado - Sem Carteira - PNADC
# 24377	Empregados no setor privado - Total - PNADC
# 24378	População na força de trabalho - PNADC
# 24379	Pessoas ocupadas - PNADC
# 24380	Pessoas desocupadas - PNADC
# 28543	População ocupada com rendimento

# 10790 Rendimento médio real efetivo das pessoas ocupadas - Total
# 10791 Rendimento médio real efetivo das pessoas ocupadas - Com carteira
# 10792 Rendimento médio real efetivo das pessoas ocupadas - Sem carteira
# 10793 Rendimento médio real efetivo das pessoas ocupadas - Conta própria
# 10794 Rendimento médio real efetivo das pessoas ocupadas - Setor privado
# 10795 Rendimento médio real efetivo das pessoas ocupadas - Setor público


# Real habitually average earnings

# 24382	Rendimento médio real habitual das pessoas ocupadas - Total - PNADC
# 24383	Rendimento médio real habitual das pessoas ocupadas - Com carteira - PNADC
# 24384	Rendimento médio real habitual das pessoas ocupadas - Sem carteira - PNADC
# 24385	Rendimento médio real habitual das pessoas ocupadas - Setor privado - PNADC
# 24386	Rendimento médio real habitual das pessoas ocupadas - Setor público - PNADC
# 24387	Rendimento médio real habitual das pessoas ocupadas - Conta própria - PNADC
# 24388	Rendimento médio real habitual das pessoas ocupadas - Empregadores - PNADC
# 24399	Rendimento médio real habitual das pessoas ocupadas - Setor privado e público - PNADC

# Household Disposable Income

# 29023	Renda disponível das famílias
# 29025	Renda disponível das famílias – deflacionada pelo IPCA

In [75]:
df = pd.read_json(r.text)
df.head(12)

C:\Users\marck\AppData\Local\Temp\ipykernel_13012\685075582.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df = pd.read_json(r.text)

          data   valor
0   01/01/1992  100.91
1   01/02/1992  100.55
2   01/03/1992  100.19
3   01/04/1992   99.90
4   01/05/1992  100.00
5   01/06/1992   99.98
6   01/07/1992   99.85
7   01/08/1992   99.69
8   01/09/1992   99.70
9   01/10/1992   99.49
10  01/11/1992   99.25
11  01/12/1992   98.04

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 336 entries, 0 to 335
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    336 non-null    object
 1   valor   336 non-null    float64
dtypes: float64(1), object(1)
memory usage: 5.4+ KB

In [78]:
df['data'] = pd.to_datetime(df['data'], dayfirst=True)

In [79]:
df['data'] = df['data'].dt.strftime('%Y-%m-%d')

In [80]:
df.head(12)

          data   valor
0   1992-01-01  100.91
1   1992-02-01  100.55
2   1992-03-01  100.19
3   1992-04-01   99.90
4   1992-05-01  100.00
5   1992-06-01   99.98
6   1992-07-01   99.85
7   1992-08-01   99.69
8   1992-09-01   99.70
9   1992-10-01   99.49
10  1992-11-01   99.25
11  1992-12-01   98.04

In [85]:
df_missing = df[df.isnull().any(axis=1) | (df == "").any(axis=1)]
df_missing.empty

True